#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"]: Refreshing state... [id=bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"]: Refreshing state... [id=bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings: Refreshing state... [id=bcparks-service-transformation/a9625322-9ea9-4a07-873f-82cfe31bad61]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"]: Refreshing state... [id=bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"]: Refreshing state... [id=bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin: Refreshing state... [id=a9625322-9ea9-4a07-873f-82cfe31bad61]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"]: Refreshing state... [id=bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"]: Refreshing state... [id=bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer: Refreshing state... [id=e5508209-a1d2-4363-98cc-0fc729026ab5]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"]: Refreshing state... [id=bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"]: Refreshing state... [id=bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"]: Refreshing state... [id=bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings: Refreshing state... [id=bcparks-service-transformation/4e91f376-a5aa-41cd-87a8-05fcf0122a45]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin: Refreshing state... [id=4e91f376-a5aa-41cd-87a8-05fcf0122a45]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer: Refreshing state... [id=be0583c5-21db-4fd2-a977-1a1acc411b28]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"]: Refreshing state... [id=bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"]: Refreshing state... [id=bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"]: Refreshing state... [id=bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28]
module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this: Refreshing state... [id=bcparks-service-transformation]
module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this: Refreshing state... [id=bcparks-service-transformation]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"]: Refreshing state... [id=bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"]: Refreshing state... [id=bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings: Refreshing state... [id=bcparks-service-transformation/e0af79f8-1908-4eb7-8abf-50c40889a0e7]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer: Refreshing state... [id=9736c14e-558b-4883-b1c7-8811d6058250]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"]: Refreshing state... [id=bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"]: Refreshing state... [id=bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin: Refreshing state... [id=e0af79f8-1908-4eb7-8abf-50c40889a0e7]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"]: Refreshing state... [id=bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"]: Refreshing state... [id=bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250]
module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this: Refreshing state... [id=bcparks-service-transformation]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin has changed
  ~ resource "keycloak_group" "admin" {
      + attributes = {}
        id         = "e0af79f8-1908-4eb7-8abf-50c40889a0e7"
        name       = "Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer has changed
  ~ resource "keycloak_group" "viewer" {
      + attributes = {}
        id         = "9736c14e-558b-4883-b1c7-8811d6058250"
        name       = "Realm Viewer"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          - "013fbd55-fafd-4fc6-af6e-9885edd56a65",
          + "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          + "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          + "d153b214-3507-4c1d-b1f5-9be8f73578fc",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          + "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          + "d153b214-3507-4c1d-b1f5-9be8f73578fc",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          - "535036a4-b46f-4a6f-9438-4490d022eada",
          + "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          + "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          + "d153b214-3507-4c1d-b1f5-9be8f73578fc",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          - "74d301f6-b8a2-447e-8402-39b47e280f80",
          + "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          + "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          + "d153b214-3507-4c1d-b1f5-9be8f73578fc",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          + "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          + "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250"
      ~ role_ids   = [
          + "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          + "d153b214-3507-4c1d-b1f5-9be8f73578fc",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
      + attributes                               = {}
      + default_default_client_scopes            = []
      + default_optional_client_scopes           = []
        id                                       = "bcparks-service-transformation"
        # (39 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin has changed
  ~ resource "keycloak_group" "admin" {
      + attributes = {}
        id         = "a9625322-9ea9-4a07-873f-82cfe31bad61"
        name       = "Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer has changed
  ~ resource "keycloak_group" "viewer" {
      + attributes = {}
        id         = "e5508209-a1d2-4363-98cc-0fc729026ab5"
        name       = "Realm Viewer"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          + "02d0b2e5-90f0-4935-8252-b75597d5d933",
          + "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          + "e891f1ac-186f-48bc-bf3b-672693e81593",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          + "02d0b2e5-90f0-4935-8252-b75597d5d933",
          + "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          + "e891f1ac-186f-48bc-bf3b-672693e81593",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          + "02d0b2e5-90f0-4935-8252-b75597d5d933",
          + "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          - "5d94bc1c-344c-4881-b205-ed61367364de",
          + "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          + "e891f1ac-186f-48bc-bf3b-672693e81593",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          + "02d0b2e5-90f0-4935-8252-b75597d5d933",
          + "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          - "e13516c6-b51d-4ad8-97b4-b98962903ce7",
          + "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          + "e891f1ac-186f-48bc-bf3b-672693e81593",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          + "02d0b2e5-90f0-4935-8252-b75597d5d933",
          + "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          + "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5"
      ~ role_ids   = [
          + "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          + "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          + "e891f1ac-186f-48bc-bf3b-672693e81593",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
      + attributes                               = {}
      + default_default_client_scopes            = []
      + default_optional_client_scopes           = []
        id                                       = "bcparks-service-transformation"
        # (39 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin has changed
  ~ resource "keycloak_group" "admin" {
      + attributes = {}
        id         = "4e91f376-a5aa-41cd-87a8-05fcf0122a45"
        name       = "Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer has changed
  ~ resource "keycloak_group" "viewer" {
      + attributes = {}
        id         = "be0583c5-21db-4fd2-a977-1a1acc411b28"
        name       = "Realm Viewer"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          + "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          + "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          + "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
          - "8cf2768f-f734-4960-94da-44e5fe2e2e6d",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          + "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          + "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          + "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
          - "c4e5eda0-3981-46d2-805a-2f8f347edaf2",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          - "0e4b9ded-1570-4b07-ad52-5715727fa5e0",
          + "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          + "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28"
      ~ role_ids   = [
          + "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          + "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
          - "9e988bd9-dbda-40b9-9e81-35c593303e11",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
      + attributes                               = {}
      + default_default_client_scopes            = []
      + default_optional_client_scopes           = []
        id                                       = "bcparks-service-transformation"
        # (39 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin will be destroyed
  # (because keycloak_group.admin is not in configuration)
  - resource "keycloak_group" "admin" {
      - attributes = {} -> null
      - id         = "e0af79f8-1908-4eb7-8abf-50c40889a0e7" -> null
      - name       = "Realm Administrator" -> null
      - path       = "/Realm Administrator" -> null
      - realm_id   = "bcparks-service-transformation" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer will be destroyed
  # (because keycloak_group.viewer is not in configuration)
  - resource "keycloak_group" "viewer" {
      - attributes = {} -> null
      - id         = "9736c14e-558b-4883-b1c7-8811d6058250" -> null
      - name       = "Realm Viewer" -> null
      - path       = "/Realm Viewer" -> null
      - realm_id   = "bcparks-service-transformation" -> null
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings will be destroyed
  # (because keycloak_group_roles.admin_role_mappings is not in configuration)
  - resource "keycloak_group_roles" "admin_role_mappings" {
      - exhaustive = true -> null
      - group_id   = "e0af79f8-1908-4eb7-8abf-50c40889a0e7" -> null
      - id         = "bcparks-service-transformation/e0af79f8-1908-4eb7-8abf-50c40889a0e7" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "89398d4b-ca03-47de-beb0-5ac164ea18b3",
        ] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "9736c14e-558b-4883-b1c7-8811d6058250" -> null
      - id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          - "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          - "d153b214-3507-4c1d-b1f5-9be8f73578fc",
        ] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "9736c14e-558b-4883-b1c7-8811d6058250" -> null
      - id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          - "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          - "d153b214-3507-4c1d-b1f5-9be8f73578fc",
        ] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "9736c14e-558b-4883-b1c7-8811d6058250" -> null
      - id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          - "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          - "d153b214-3507-4c1d-b1f5-9be8f73578fc",
        ] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "9736c14e-558b-4883-b1c7-8811d6058250" -> null
      - id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          - "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          - "d153b214-3507-4c1d-b1f5-9be8f73578fc",
        ] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "9736c14e-558b-4883-b1c7-8811d6058250" -> null
      - id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          - "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          - "d153b214-3507-4c1d-b1f5-9be8f73578fc",
        ] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "9736c14e-558b-4883-b1c7-8811d6058250" -> null
      - id         = "bcparks-service-transformation/9736c14e-558b-4883-b1c7-8811d6058250" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          - "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          - "d153b214-3507-4c1d-b1f5-9be8f73578fc",
        ] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = (known after apply)
      + access_code_lifespan_login               = (known after apply)
      + access_code_lifespan_user_action         = (known after apply)
      + access_token_lifespan                    = (known after apply)
      + access_token_lifespan_for_implicit_flow  = (known after apply)
      + action_token_generated_by_admin_lifespan = (known after apply)
      + action_token_generated_by_user_lifespan  = (known after apply)
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = (known after apply)
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_with_email_allowed                 = (known after apply)
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = (known after apply)
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "kuro-dev-test-new-realm"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = false
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin will be destroyed
  # (because keycloak_group.admin is not in configuration)
  - resource "keycloak_group" "admin" {
      - attributes = {} -> null
      - id         = "a9625322-9ea9-4a07-873f-82cfe31bad61" -> null
      - name       = "Realm Administrator" -> null
      - path       = "/Realm Administrator" -> null
      - realm_id   = "bcparks-service-transformation" -> null
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer will be destroyed
  # (because keycloak_group.viewer is not in configuration)
  - resource "keycloak_group" "viewer" {
      - attributes = {} -> null
      - id         = "e5508209-a1d2-4363-98cc-0fc729026ab5" -> null
      - name       = "Realm Viewer" -> null
      - path       = "/Realm Viewer" -> null
      - realm_id   = "bcparks-service-transformation" -> null
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings will be destroyed
  # (because keycloak_group_roles.admin_role_mappings is not in configuration)
  - resource "keycloak_group_roles" "admin_role_mappings" {
      - exhaustive = true -> null
      - group_id   = "a9625322-9ea9-4a07-873f-82cfe31bad61" -> null
      - id         = "bcparks-service-transformation/a9625322-9ea9-4a07-873f-82cfe31bad61" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "d220156e-e427-49c7-b05d-53fc5918f5d1",
        ] -> null
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "e5508209-a1d2-4363-98cc-0fc729026ab5" -> null
      - id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "02d0b2e5-90f0-4935-8252-b75597d5d933",
          - "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          - "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          - "e891f1ac-186f-48bc-bf3b-672693e81593",
        ] -> null
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "e5508209-a1d2-4363-98cc-0fc729026ab5" -> null
      - id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "02d0b2e5-90f0-4935-8252-b75597d5d933",
          - "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          - "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          - "e891f1ac-186f-48bc-bf3b-672693e81593",
        ] -> null
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "e5508209-a1d2-4363-98cc-0fc729026ab5" -> null
      - id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "02d0b2e5-90f0-4935-8252-b75597d5d933",
          - "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          - "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          - "e891f1ac-186f-48bc-bf3b-672693e81593",
        ] -> null
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "e5508209-a1d2-4363-98cc-0fc729026ab5" -> null
      - id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "02d0b2e5-90f0-4935-8252-b75597d5d933",
          - "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          - "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          - "e891f1ac-186f-48bc-bf3b-672693e81593",
        ] -> null
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "e5508209-a1d2-4363-98cc-0fc729026ab5" -> null
      - id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "02d0b2e5-90f0-4935-8252-b75597d5d933",
          - "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          - "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          - "e891f1ac-186f-48bc-bf3b-672693e81593",
        ] -> null
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "e5508209-a1d2-4363-98cc-0fc729026ab5" -> null
      - id         = "bcparks-service-transformation/e5508209-a1d2-4363-98cc-0fc729026ab5" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "02d0b2e5-90f0-4935-8252-b75597d5d933",
          - "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          - "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          - "e891f1ac-186f-48bc-bf3b-672693e81593",
        ] -> null
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group.admin will be destroyed
  # (because keycloak_group.admin is not in configuration)
  - resource "keycloak_group" "admin" {
      - attributes = {} -> null
      - id         = "4e91f376-a5aa-41cd-87a8-05fcf0122a45" -> null
      - name       = "Realm Administrator" -> null
      - path       = "/Realm Administrator" -> null
      - realm_id   = "bcparks-service-transformation" -> null
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group.viewer will be destroyed
  # (because keycloak_group.viewer is not in configuration)
  - resource "keycloak_group" "viewer" {
      - attributes = {} -> null
      - id         = "be0583c5-21db-4fd2-a977-1a1acc411b28" -> null
      - name       = "Realm Viewer" -> null
      - path       = "/Realm Viewer" -> null
      - realm_id   = "bcparks-service-transformation" -> null
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.admin_role_mappings will be destroyed
  # (because keycloak_group_roles.admin_role_mappings is not in configuration)
  - resource "keycloak_group_roles" "admin_role_mappings" {
      - exhaustive = true -> null
      - group_id   = "4e91f376-a5aa-41cd-87a8-05fcf0122a45" -> null
      - id         = "bcparks-service-transformation/4e91f376-a5aa-41cd-87a8-05fcf0122a45" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "91f4ef8d-9916-427b-a4b2-b32a224aa86f",
        ] -> null
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-authorization"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "be0583c5-21db-4fd2-a977-1a1acc411b28" -> null
      - id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          - "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
        ] -> null
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-clients"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "be0583c5-21db-4fd2-a977-1a1acc411b28" -> null
      - id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          - "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
        ] -> null
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-events"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "be0583c5-21db-4fd2-a977-1a1acc411b28" -> null
      - id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          - "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
        ] -> null
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-identity-providers"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "be0583c5-21db-4fd2-a977-1a1acc411b28" -> null
      - id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          - "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
        ] -> null
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-realm"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "be0583c5-21db-4fd2-a977-1a1acc411b28" -> null
      - id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          - "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
        ] -> null
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.keycloak_group_roles.viewer_roles["view-users"] will be destroyed
  # (because keycloak_group_roles.viewer_roles is not in configuration)
  - resource "keycloak_group_roles" "viewer_roles" {
      - exhaustive = true -> null
      - group_id   = "be0583c5-21db-4fd2-a977-1a1acc411b28" -> null
      - id         = "bcparks-service-transformation/be0583c5-21db-4fd2-a977-1a1acc411b28" -> null
      - realm_id   = "bcparks-service-transformation" -> null
      - role_ids   = [
          - "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          - "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
        ] -> null
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "bcparks-service-transformation Realm Administrator"
      + path     = (known after apply)
      + realm_id = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "master"
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "bcparks-service-transformation-realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "bcparks-service-transformation-realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "master"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = "master"
      + role                    = "bcparks-service-transformation-realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = [
          + "05a865c2-0baf-434b-8bb5-26da5f719eb8",
          + "3a26c14b-7446-4efe-adba-3f724ccad6b9",
          + "3eab0d88-896e-4950-924a-1d47281e7ae2",
          + "41b7ae1a-17d6-4c3a-9d56-dcbd4c351675",
          + "4345faf0-5194-42ea-88da-17109ea0cc6a",
          + "4fe7615c-66df-4ec0-9c64-ba47392a6942",
          + "57a258b2-41cb-4b89-8ed9-21f6fbdcfb1e",
          + "632d8767-da11-4146-8fd2-58d38d451415",
          + "7f80b376-f033-4fa6-be98-6dd3280ede87",
          + "8013f3a8-4224-4cb5-9c5d-ad4d58a14951",
          + "94073b58-9c32-409d-a440-0ded7d3a56de",
          + "94ed32af-5e65-42da-a0c5-6ad109d0b7a1",
          + "9d2cc705-7078-48b7-8624-db5f8d1a6fb2",
          + "d838858a-880a-4fe3-8a06-0f6c15eb40fa",
          + "daa69512-c634-4978-913f-8f96c24280e2",
          + "dfdcdaac-1a89-4ba2-b146-17276213bb20",
          + "e8b987d4-e4f0-45c1-a14e-61a548ea9669",
          + "f82c59e9-b28c-4062-9153-11389ee110d7",
        ]
      + id              = (known after apply)
      + name            = "bcparks-service-transformation-realm-admin"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "kuro-dev-test-new-realm-realm"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = "master"
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["create-client"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "create-client"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["impersonation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "impersonation"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-clients"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-events"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-realm"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-users"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["query-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-clients"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["query-groups"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-groups"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["query-realms"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-realms"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["query-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-users"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "kuro-dev-test-new-realm Realm Administrator"
      + path     = (known after apply)
      + realm_id = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "master"
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "kuro-dev-test-new-realm-realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "kuro-dev-test-new-realm-realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "master"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = "master"
      + role                    = "kuro-dev-test-new-realm-realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin_master.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "kuro-dev-test-new-realm-realm-admin"
      + realm_id        = "master"
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "bcparks-service-transformation Realm Administrator"
      + path     = (known after apply)
      + realm_id = "master"
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "master"
      + role_ids   = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "bcparks-service-transformation-realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "bcparks-service-transformation-realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "master"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = "master"
      + role                    = "bcparks-service-transformation-realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = [
          + "1975a280-4983-4276-8588-09886354b27d",
          + "2225820c-5d38-4b86-8f48-4cd50e5775f3",
          + "23747d35-9fda-4167-8d37-b090c7e4f387",
          + "3c1de308-8805-495a-a557-3708258c03e8",
          + "4a027255-e018-45a4-ad46-15e65a40e991",
          + "873cea4b-4c52-4b8e-b9a2-47a5fad670a1",
          + "8a0ecec0-280b-455e-af02-db54a1c15369",
          + "8c0880e4-652e-4f1c-b133-a462a95a2eb5",
          + "982733d0-6770-44db-a77a-0d0109d27a17",
          + "a4c8aacb-e45c-451b-804e-5d954e0f1cc2",
          + "c9b8ce90-1486-4543-9158-c97628469c64",
          + "cbf0b362-dbae-4094-ba0c-d5c705e71ee3",
          + "cde3f9cb-dc81-4ac4-a48f-5b1945a335e5",
          + "d845f6c4-e24d-4b45-a061-e6583a3a1389",
          + "daf17cc2-f242-483a-9ba0-124c6ef83cf3",
          + "ed0f5533-f02b-4c1c-9da0-7e907a87f092",
          + "f80d53fd-634b-4e8f-8ea1-b616a881c9a3",
          + "f8fdafbb-1e97-40bf-8bce-d8a930f936ed",
        ]
      + id              = (known after apply)
      + name            = "bcparks-service-transformation-realm-admin"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "bcparks-service-transformation Realm Administrator"
      + path     = (known after apply)
      + realm_id = "master"
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "master"
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "bcparks-service-transformation-realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "bcparks-service-transformation-realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "master"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = "master"
      + role                    = "bcparks-service-transformation-realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin_master.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = [
          + "06a8ab5e-3de5-458a-a284-d9a32ac8a8f1",
          + "1b06532e-af90-478b-af1d-29caa1cb710e",
          + "1dc60287-5fbf-4c95-81c0-50a6dfc46b86",
          + "2482b575-124c-4eac-a85b-be56e59824bb",
          + "2e0a1a33-2abd-4989-b098-d0a83c95d302",
          + "2ed6d2cf-d2ca-4c3a-8c52-1ec8ddb10510",
          + "40b54bb3-2dff-451c-a5e4-911f049815dd",
          + "40cedc4c-f003-4bd3-bc8c-2f644515b348",
          + "4298460e-0541-4b27-a253-a740330bf4e0",
          + "7b014f1d-f78c-499e-bdbf-b978a5ab7e62",
          + "97a5daa8-779e-4f46-b092-1261b268e0b5",
          + "9ac19721-9faa-42c0-89f2-15a51d6bd0ff",
          + "a4fed23e-a154-4bb8-a1ac-4c969adc6e72",
          + "b010542a-9543-4e20-a026-9b0baa816ba4",
          + "bf435f38-9a0b-47d7-836f-8da4e0427672",
          + "c32d109f-4a9e-4c98-95f0-10f913954de5",
          + "d468879f-6981-465f-8fe2-55bb46edfcc3",
          + "d4977088-c55d-45c7-926c-b962a156b96a",
        ]
      + id              = (known after apply)
      + name            = "bcparks-service-transformation-realm-admin"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = "bcparks-service-transformation"
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "bcparks-service-transformation"
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "bcparks-service-transformation"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = "bcparks-service-transformation"
      + role                    = "realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = [
          + "89398d4b-ca03-47de-beb0-5ac164ea18b3",
        ]
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = "bcparks-service-transformation"
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = "bcparks-service-transformation"
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "bcparks-service-transformation"
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-viewer-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-viewer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "bcparks-service-transformation"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = "bcparks-service-transformation"
      + role                    = "realm-viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = [
          + "013fbd55-fafd-4fc6-af6e-9885edd56a65",
          + "535036a4-b46f-4a6f-9438-4490d022eada",
          + "74d301f6-b8a2-447e-8402-39b47e280f80",
          + "74eaf278-a0f6-4077-b0c2-9abf95b6e7f2",
          + "ced257e6-5ae1-4a53-8451-3df2faf30e0f",
          + "d153b214-3507-4c1d-b1f5-9be8f73578fc",
        ]
      + id              = (known after apply)
      + name            = "realm-viewer"
      + realm_id        = "bcparks-service-transformation"
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin.module.realm_admin.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin.module.realm_admin.data.keycloak_role.target_roles["realm-admin"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_admin.module.realm_admin.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-viewer-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-viewer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.kuro-new-realm.module.realm_viewer.module.realm_viewer.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-viewer"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = "bcparks-service-transformation"
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "bcparks-service-transformation"
      + role_ids   = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "bcparks-service-transformation"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = "bcparks-service-transformation"
      + role                    = "realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = [
          + "d220156e-e427-49c7-b05d-53fc5918f5d1",
        ]
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = "bcparks-service-transformation"
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = "bcparks-service-transformation"
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "bcparks-service-transformation"
      + role_ids   = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-viewer-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-viewer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "bcparks-service-transformation"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = "bcparks-service-transformation"
      + role                    = "realm-viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = [
          + "02d0b2e5-90f0-4935-8252-b75597d5d933",
          + "5107caaa-25bb-40f7-a4b0-aac9dcd03adc",
          + "5d94bc1c-344c-4881-b205-ed61367364de",
          + "e13516c6-b51d-4ad8-97b4-b98962903ce7",
          + "e7f294a9-c797-4c9e-80ab-bbfe1ad96622",
          + "e891f1ac-186f-48bc-bf3b-672693e81593",
        ]
      + id              = (known after apply)
      + name            = "realm-viewer"
      + realm_id        = "bcparks-service-transformation"
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = "bcparks-service-transformation"
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "bcparks-service-transformation"
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "bcparks-service-transformation"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = "bcparks-service-transformation"
      + role                    = "realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_admin.module.realm_admin.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = [
          + "91f4ef8d-9916-427b-a4b2-b32a224aa86f",
        ]
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = "bcparks-service-transformation"
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = "bcparks-service-transformation"
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "bcparks-service-transformation"
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-viewer-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-viewer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "bcparks-service-transformation"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = "bcparks-service-transformation"
      + role                    = "realm-viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.bcparks-service-transformation.module.realm_viewer.module.realm_viewer.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = [
          + "0e4b9ded-1570-4b07-ad52-5715727fa5e0",
          + "28508fcb-395d-45b7-8d9a-6830c1ad2c94",
          + "3881147e-df5f-42de-8dc7-5a8deeffbf2d",
          + "8cf2768f-f734-4960-94da-44e5fe2e2e6d",
          + "9e988bd9-dbda-40b9-9e81-35c593303e11",
          + "c4e5eda0-3981-46d2-805a-2f8f347edaf2",
        ]
      + id              = (known after apply)
      + name            = "realm-viewer"
      + realm_id        = "bcparks-service-transformation"
    }

Plan: 61 to add, 0 to change, 27 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @kurokn, Action: `pull_request`*